fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Создана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыставленныеАкты</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <comment>Дата начала абонентского обслуживания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <comment>Дата окончания абонентского обслуживания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
&НаСервере
Процедура ЗаполнитьДоговоры() Экспорт
	
	Договоры.Очистить();
	
	Если Период = Неопределено Или Период = Дата(1, 1, 1) Тогда
		Возврат;
	КонецЕсли;
	
	НачалоПериода = НачалоМесяца(Период);
	КонецПериода = КонецМесяца(Период);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Стр = Договоры.Добавить();
		Стр.Договор = Выборка.Договор;
		
		Реализация = НайтиРеализациюЗаПериод(Выборка.Договор, НачалоПериода, КонецПериода);
		Стр.Реализация = Реализация;
		Стр.Создана = ЗначениеЗаполнено(Реализация);
		
		Если Стр.Создана Тогда
			Стр.Комментарий = "Уже существует";
		Иначе
			Стр.Комментарий = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСозданиеНаСервере(Параметры) Экспорт
	
	Период = Параметры.Период;
	
	Договоры.Очистить();
	Для Каждого Элемент Из Параметры.Договоры Цикл
		Стр = Договоры.Добавить();
		Стр.Договор = Элемент.Договор;
		Стр.Реализация = Неопределено;
		Стр.Создана = Ложь;
		Стр.Комментарий = "";
	КонецЦикла;
	
	СоздатьРеализацииПоДоговорам();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеализацииПоДоговорам() Экспорт
	
	Если Период = Неопределено Или Период = Дата(1, 1, 1) Тогда
		ВызватьИсключение "Не указан период.";
	КонецЕсли;
	
	НачалоПериода = НачалоМесяца(Период);
	КонецПериода = КонецМесяца(Период);
	
	Для Каждого Стр Из Договоры Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Договор) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.Реализация) Тогда
			Стр.Создана = Истина;
			Стр.Комментарий = "Уже существует";
			Продолжить;
		КонецЕсли;
		
		СуществующаяРеализация = НайтиРеализациюЗаПериод(Стр.Договор, НачалоПериода, КонецПериода);
		
		Если ЗначениеЗаполнено(СуществующаяРеализация) Тогда
			Стр.Реализация = СуществующаяРеализация;
			Стр.Создана = Истина;
			Стр.Комментарий = "Уже существует";
			Продолжить;
		КонецЕсли;
		
		Попытка
			НоваяРеализация = СоздатьРеализациюПоДоговору(Стр.Договор, КонецПериода);
			Стр.Реализация = НоваяРеализация.Ссылка;
			Стр.Создана = Истина;
			Стр.Комментарий = "Создана";
		Исключение
			Стр.Создана = Ложь;
			Стр.Комментарий = ОписаниеОшибки();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиРеализациюЗаПериод(Договор, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Реализация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализация
	|ГДЕ
	|	Реализация.Договор = &Договор
	|	И Реализация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Реализация.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция СоздатьРеализациюПоДоговору(Договор, ДатаДокумента) Экспорт
	
	ДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	ДокОбъект.Заполнить(Неопределено);
	ДокОбъект.Дата = ДатаДокумента;
	ДокОбъект.Договор = Договор;
	ДокОбъект.Контрагент = Договор.Владелец;
	ДокОбъект.Организация = Договор.Организация;
	
	ДокОбъект.ВКМ_ВыполнитьАвтозаполнение();
	ДокОбъект.ПроверитьЗаполнение();
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокОбъект;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляФормы() Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Стр Из Договоры Цикл
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Договор", Стр.Договор);
		СтруктураСтроки.Вставить("Реализация", Стр.Реализация);
		СтруктураСтроки.Вставить("Создана", Стр.Создана);
		СтруктураСтроки.Вставить("Комментарий", Стр.Комментарий);
		Результат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
